Repository: EfstathiosChatzikyriakidis/zepto-web-server
Catalog: po/*/zws.po
Languages: el

source: Failed to create a new process.
el: Αποτυχία δημιουργίας νέας διεργασίας.

source: Failed to create a new session.
el: Αποτυχία δημιουργίας νέας συνεδρίας.

source: Failed to open the virtual null device file.
el: Αποτυχία ανοίγματος του εικονικού αρχείου συσκευής NULL.

source: Failed to redirect the standard I/O streams.
el: Αποτυχία ανακατεύθυνσης των πρότυπων ρευμάτων εισόδου / εξόδου.

source: Failed to change the working directory.
el: Αποτυχία αλλαγής του καταλόγου εργασίας.

source: Failed to write the pid file.
el: Αποτυχία εγγραφής του αρχείου PID.

source: Failed to remove the pid file.
el: Αποτυχία διαγραφής του αρχείου PID.

source: Failed to close the file descriptor:
el: Αποτυχία κλεισίματος του περιγραφέα αρχείου:

source: Failed to close the descriptor of the virtual null device file.
el: Αποτυχία κλεισίματος του περιγραφέα του εικονικού αρχείου συσκευής NULL.

source: The pid file is not readable.
el: Το αρχείο PID δεν είναι αναγνώσιμο.

source: Another instance probably is running.
el: Ένα άλλο στιγμιότυπο πιθανότατα εκτελείται.

source: Failed to create a new service worker in the server.
el: Αποτυχία δημιουργίας νέου εργάτη εξυπηρέτησης στον εξυπηρετητή.

source: Failed to clean the service workers of the server.
el: Αποτυχία καθαρισμού των εργατών εξυπηρέτησης του εξυπηρετητή.

source: Failed to initialize the set of the blocked signals.
el: Αποτυχία αρχικοποίησης του συνόλου των μπλοκαρισμένων σημάτων.

source: Failed to add the SIGCHLD signal in the set of the blocked signals.
el: Αποτυχία προσθήκης του σήματος SIGCHLD στο σύνολο των μπλοκαρισμένων σημάτων.

source: Failed to enable the set of the blocked signals.
el: Αποτυχία ενεργοποίησης του συνόλου των μπλοκαρισμένων σημάτων.

source: Failed to disable the set of the blocked signals.
el: Αποτυχία απενεργοποίησης του συνόλου των μπλοκαρισμένων σημάτων.

source: Failed to allocate memory for the socket address.
el: Αποτυχία δέσμευσης μνήμης για την διεύθυνση της δικτυακής υποδοχής.

source: Failed to get the socket name.
el: Αποτυχία απόκτησης του ονόματος της δικτυακής υποδοχής.

source: Failed to connect the server socket.
el: Αποτυχία σύνδεσης της δικτυακής υποδοχής του εξυπηρετητή.

source: Failed to instruct the server socket to listen for incoming requests.
el: Αποτυχία ανάθεσης της δικτυακής υποδοχής του εξυπηρετητή στο να «ακούει» εισερχόμενες αιτήσεις.

source: Failed to disable the I/O blocking of the server socket descriptor.
el: Αποτυχία απενεργοποίησης του μπλοκαρίσματος εισόδου / εξόδου του περιγραφέα της δικτυακής υποδοχής του εξυπηρετητή.

source: Failed to setup the signals support of the server.
el: Αποτυχία εγκατάστασης της υποστήριξης σημάτων του εξυπηρετητή.

source: Failed to close the server socket descriptor.
el: Αποτυχία κλεισίματος του περιγραφέα της δικτυακής υποδοχής του εξυπηρετητή.

source: Failed to get the host name and the service of the server.
el: Αποτυχία απόκτησης του ονόματος υπολογιστή και της υπηρεσίας του εξυπηρετητή.

source: The server listens on the following socket:
el: Ο εξυπηρετητής «ακούει» στην ακόλουθη δικτυακή υποδοχή:

source: Failed to kill the service workers of the server.
el: Αποτυχία τερματισμού των εργατών εξυπηρέτησης του εξυπηρετητή.

source: Failed to setup the signals support for a service worker of the server.
el: Αποτυχία εγκατάστασης της υποστήριξης σημάτων ενός εργάτη εξυπηρέτησης του εξυπηρετητή.

source: Failed to close the client socket descriptor.
el: Αποτυχία κλεισίματος του περιγραφέα της δικτυακής υποδοχής του πελάτη.

source: Failed to initialize the set of all signals.
el: Αποτυχία αρχικοποίησης του συνόλου όλων των σημάτων.

source: Failed to change the action of the signal:
el: Αποτυχία αλλαγής της ενέργειας του σήματος:

source: Failed to allocate memory.
el: Αποτυχία δέσμευσης μνήμης.

source: Usage:
el: Χρήση:

source: [OPTIONS] -m PATH
el: [ΕΠΙΛΟΓΕΣ] -m ΜΟΝΟΠΑΤΙ

source: -a, --address=ADDRESS The address of the server. -p, --port=NUMBER The port of the server. -w, --workers=NUMBER The number of the service workers of the server. -r, --requests=NUMBER The number of the requests per service worker. -m, --modules=PATH The modules path of the server. --help Display help and exit. --version Display version and exit.
el: -a, --address=ΔΙΕΥΘΥΝΣΗ Η διεύθυνση του εξυπηρετητή. -p, --port=ΑΡΙΘΜΟΣ Η πόρτα του εξυπηρετητή. -w, --workers=ΑΡΙΘΜΟΣ Ο αριθμός των εργατών εξυπηρέτησης του εξυπηρετητή. -r, --requests=ΑΡΙΘΜΟΣ Ο αριθμός των αιτήσεων ανά εργάτη εξυπηρέτησης. -m, --modules=ΜΟΝΟΠΑΤΙ Το μονοπάτι των φορτώσιμων μονάδων του εξυπηρετητή. --help Εμφάνιση βοήθειας και έξοδος. --version Εμφάνιση έκδοσης και έξοδος.

source: Report bugs to
el: Αναφορά σφαλμάτων στο
